app/controllers/api/notifications_controller.rb

    def index
      notifications = Notification.where(customer_id: params[:customer_id])
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."customer_id" = $1  [["customer_id", 1]]